Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: You can also use this syntax to see where a branch was some specific amount of time ago.
es: Esta misma sintaxis puede emplearse cuando se desea ver dónde estaba una rama en un momento específico en el tiempo.

source: However, you can inject text into a file when it’s checked out and remove it again before it’s added to a commit.
es: De todas formas, es posible inyectar textos en un archivo cuando lo extraemos del repositorio (checkout) y quitarlos de nuevo antes de devolverlo al repositorio (commit).

source: Rebasing a topic branch off another topic branch.
es: Reorganizando una rama puntual fuera de otra rama puntual.

source: Because you only want the `old-file` and `new-file` arguments, you use the wrapper script to pass the ones you need.
es: Ya que solo necesitarás 'old-file' y 'new-file', puedes utilizar el siguiente script para extraerlos:

source: You should feel comfortable creating and switching to new branches, switching between branches and merging local branches together.
es: A estas alturas, te sentirás cómodo creando nuevas ramas (branch), saltando (checkout) entre ramas para trabajar y fusionando (merge) ramas entre ellas.

source: Next, access over SSH is secure — all data transfer is encrypted and authenticated.
es: Además, el acceso a través de SSH es seguro, estando todas las transferencias encriptadas y autentificadas.

source: Your fork of a project.
es: Tu bifurcación (fork) de un proyecto.

source: From the interactive prompt, type `5` or `p` (for patch).
es: En el indicador interactivo se ha de teclear '5' o 'p' (patch).

source: Now it’s time to initialize Gitosis.
es: Y, en este punto, ya podemos inicializar Gitosis.

source: Yes, I’m using global variables.
es: Sí, estoy usando variables globales.

source: In any case, the Git protocol is relatively easy to set up.
es: En cualquier caso, el protocolo Git es relativamente sencillo de configurar.

source: What then?
es: ¿Y qué sucederia si se diera ese caso?

source: The tag object is very much like a commit object — it contains a tagger, a date, a message, and a pointer.
es: El objeto tipo etiqueta es muy parecido al tipo confirmación de cambios, --contiene un marcador, una fecha, un mensaje y un enlace--.

source: First, you create a 'git' user and a `.ssh` directory for that user.
es: Comienzas creando un usuario 'git' y una carpeta '.ssh' para él.

source: You work on your web site and do some commits.
es: Trabajas en el sitio web y haces algunas confirmaciones de cambios (commits).

source: That commit is when this file was first added to this project, and those lines have been unchanged since.
es: (la confirmación en la que este archivo se incluyó en el proyecto por primera vez). No habiendo sufrido esas líneas ninguna modificación desde entonces.

source: The beauty of the HTTP or HTTPS protocol is the simplicity of setting it up.
es: Cuya belleza radica en la simplicidad para habilitarlo.

source: What does that mean?
es: Y eso, ¿qué significa?

source: Insert 18333fig0304.png Figure 3-4.
es: Insert 18333fig0304.png Figura 3-4.

source: You have your tree object, so you continue walking your commits.
es: Cuando tengas el objeto árbol, puedes continuar avanzando por las confirmaciones de cambio.

source: #### Other Client Hooks ####
es: #### Otros puntos de enganche del lado cliente ####

source: You need to check out the `master` branch when you’ve completed the process.
es: Ves que es la rama`master` la que has de activar cuando el proceso esté completado.

source: Now that you’ve seen the difficulties of the submodule system, let’s look at an alternate way to solve the same problem.
es: Ahora que se han visto las dificultades que se pueden presentar utilizando el sistema de submódulos, es momento de hechar un vistazo a una vía alternativa de atacar esa misma problemática.

source: SSH is also an authenticated network protocol; and because it’s ubiquitous, it’s generally easy to set up and use.
es: Otra ventaja de SSH es el su mecanismo de autentificación, sencillo de habilitar y de usar.

source: If you’re merging two branches, Git uses a _recursive_ strategy.
es: Si se están fusionando dos ramas, Git suele utilizar la _estategia_recursiva_ (_recursive_ strategy).

source: ## Maintaining a Project ##
es: ## Gestionando un proyecto ##

source: If you run `git gc`, you’ll no longer have these files in the `refs` directory.
es: Lanzando el comando `git gc`, dejarás de tener esos archivos en la carpeta `refs`.

source: Then, when you switch back, you get an empty `rack` directory.
es: Y, cuando se retorne a la rama anterior, se tendrá una carpeta 'rack' vacia.

source: It takes no arguments and is run after the patch is applied, so you can use it to inspect the snapshot before making the commit.
es: No recibe ningún argumento de entrada y se lanza después de que el parche haya sido aplicado, por lo que puedes utilizarlo para revisar la situación (snapshot) antes de confirmarla.

source: If your public key isn’t on the server, you’ll have to copy it there:
es: Si tu clave pública personal no está en el servidor, la has de copiar a él:

source: You can start up interactive Ruby mode with the `irb` command:
es: Puedes arrancar el modo interactivo de Ruby con el comando `irb`:

source: To begin, she starts a new feature branch, basing it off the server’s `master` branch:
es: Para empezar, arranca una nueva rama puntual, basada en la rama 'master' del servidor:

source: ## Setting Up the Server ##
es: ## Preparando el servidor ##

source: At this point, your project working directory is exactly the way it was before you started working on issue #53, and you can concentrate on your hotfix.
es: Tras esto, tendrás la carpeta de trabajo exactamente igual a como estaba antes de comenzar a trabajar sobre el problema #53. Y podrás concentrarte en el nuevo problema urgente.

source: For instance, to see where your `master` branch was yesterday, you can type
es: Por ejemplo, para ver dónde apuntaba la rama 'master' en el día de ayer, se puede teclear:

source: Congratulations on being an effective Git developer!
es: Felicidades por haber llegado a ser un desarrollador Git efectivo!.

source: You have to change the path to the ACL file from this
es: Esto obliga a cambiar la ubicación del archivo ACL de

source: That way, the maintainer doesn’t have to do any integration work — just a fast-forward or a clean apply.
es: De esta forma, la persona que mantiene el proyecto no necesitará hacer ninguna integración con tu trabajo; le bastará con un avance rápido o una incorporación limpia.

source: ### Reordering Commits ###
es: ### Reordenar confirmaciones de cambios ###

source: The next variable is the workflow in use for the project.
es: La segunda variable es la forma de trabajo que se utilice para el proyecto.

source: Because you don’t have the permissions to directly update branches on the project, you have to get the work to the maintainers some other way.
es: Ya que no tendrás permisos para actualizar ramas directamente sobre el proyecto, has de enviar el trabajo a los gestores de otra manera.

source: (I’m replacing the protocol messages with `...` in these examples to shorten them somewhat.)
es: (en estos ejemplos estoy sustituyendo los mensajes del protocolo con '...' , para acortarlos)

source: You’re likely to have to either include this code from a shared library like a CPAN install or Ruby gem, or copy the source code into your own project tree.
es: Y dicha biblioteca se incluye desde una biblioteca compartida tal como CPAN install o Ruby gem; o copiando directamente su código fuente en el árbol del propio proyecto.

source: You regularly push both of these branches to the public repository.
es: Ambas ramas se enviarán periodicamente al repositorio público.

source: The dictator pushes their master to the reference repository so the other developers can rebase on it.
es: El dictador envia (push) su rama master al repositorio de referencia, para permitir que los desarrolladores reorganicen (rebase) desde ella.

source: You can go into that subdirectory, make changes, add your own writable remote repository to push your changes into, fetch and merge from the original repository, and more.
es: En dicha subcarpeta es posible realizar cambios, añadir un repositorio propio a donde enviar (push) los cambios, recuperar (fetch) y fusionar (merge) desde el repositorio original, y mucho mas...

source: Git allows you to specify specific commits or a range of commits in several ways.
es: Git tiene varios modos de seleccionar confirmaciones de cambio o grupos de confirmaciones de cambio.

source: The apply option only tries to apply the stashed work — you continue to have it on your stack.
es: Los comandos `git stash apply` tan solo recuperan cambios almacenados en la pila de guardado rápido, sin afectar al estado de la pila. Es decir, los cambios siguen estando guardados en la pila.

source: You’ll often want to do two basic things to your last commit: change the commit message, or change the snapshot you just recorded by adding, changing and removing files.
es: Dos suelen ser los cambios básicos a realizar: cambiar el mensaje o cambiar los archivos añadidos, modificados o borrados.

source: Notice that the first field is the partial SHA-1 of the commit that last modified that line.
es: Merece destacar que el primer campo mostrado en cada línea es el código SHA-1 parcial de la confirmación de cambios en que se modificó dicha línea por última vez.

source: This is a bit of a shortcut.
es: Esto es un poco como un atajo.

source: ## Hosted Git ##
es: ## Git en un alojamiento externo ##

source: So far, I’ve covered the basics of how Git works and how to use it, and I’ve introduced a number of tools that Git provides to help you use it easily and efficiently.
es: Hasta ahora, hemos visto los aspectos básicos del funcionamiento de Git y la manera de utilizarlo; además de haber presentado una serie de herramientas suministradas con Git para ayudarnos a usarlo de manera sencilla y eficiente.

source: After your super-important fix is deployed, you’re ready to switch back to the work you were doing before you were interrupted.
es: Tras haber resuelto el problema urgente que te habia interrumpido tu trabajo, puedes volver a donde estabas.

source: In addition to knowing how to effectively contribute to a project, you’ll likely need to know how to maintain one.
es: Además de conocer cómo contribuir de forma efectiva a un proyecto, es posible que desees saber tambien cómo mantener uno.

source: Also, as long as you stay out of contact with your origin server, your `origin/master` pointer doesn’t move (see Figure 3-23).
es: Además, mientras no tengas contacto con el servidor, tu apuntador a tu rama 'origin/master' no se moverá (ver Figura 3/23).

source: Perhaps your main branch has diverged too far from the branch the patch was built from, or the patch depends on another patch you haven’t applied yet.
es: Es posible que tu rama principal diverja demasiado respecto de la rama sobre la que se construyó el parche; o que el parche tenga dependencias respecto de algún otro parche anterior que aún no hayas incorporado.

source: In this scenario, you have two long-running branches, `master` and `develop`, in which you determine that `master` is updated only when a very stable release is cut and all new code is integrated into the `develop` branch.
es: En este escenario, se dispone de dos ramas de largo recorrido: 'master' y 'develop'. La primera de ellas, 'master', será actualizada únicamente por los lanzamientos de código muy estable. La segunda rama, 'develop', es donde iremos integrando todo el código nuevo.

source: Because it’s reachable from the history, it will always be there.
es: Porque en algún momento formó parte del proyecto, siempre permanecerá ahí.

source: Suppose you decide that you want to merge your client-side changes into your mainline for a release, but you want to hold off on the server-side changes until it’s tested further.
es: Imagina que decides incorporar tus cambios de la parte cliente sobre el proyecto principal, para hacer un lanzamiento de versión; pero no quieres lanzar aún los cambios de la parte server porque no están aún suficientemente probados.

source: Git will detect these issues when you run a `git diff` command and try to color them so you can possibly fix them before you commit.
es: Git detectará posibles problemas cuando lance un comando 'git diff', e intentará destacarlos en otro color para que puedas corregirlos antes de confirmar cambios (commit).

source: The next line is 0000, meaning the server is done with its references listing.
es: Y la última linea comienza con 0000, indicando así que la lista de referencias ha terminado.

source: When you land on a project page that looks interesting and you want to hack on it a bit, you can click the "fork" button in the project header to have GitHub copy that project to your user so you can push to it.
es: Cuando aterrizas en la página de un proyecto que te parece interesante y con el que deseas trastear un poco, puedes clicar sobre el botón "fork" de la cabecera del proyecto; de tal forma que GitHub haga una copia del proyecto a tu cuenta de usuario y puedas así enviar (push) cambios sobre él.

source: You can also specify a number after the `^` — for example, `d921970^2` means "the second parent of d921970." This syntax is only useful for merge commits, which have more than one parent.
es: También es posible indicar un número detras de '^'. Por ejemplo `d921970^2`, para indicar "el segundo padre de d921970" . Aunque esta sentencia es útil tan solo en confirmaciones de fusiones (merge), los únicos tipos de confirmación de cambios que pueden tener más de un padre.

source: Your change is now in the snapshot of the commit pointed to by the `master` branch, and you can deploy your change (see Figure 3-14).
es: Ahora, los cambios realizados están ya en la instantánea (snapshot) de la confirmación (commit) apuntada por la rama 'master'. Y puedes desplegarlos (ver Figura 3-14)

source: ### Private Managed Team ###
es: ### Grupo Privado Gestionado ###

source: The committing-workflow client-side scripts can be used in just about any workflow.
es: Los scripts del lado cliente relacionados con la confirmación de cambios pueden ser utilizados en prácticamente cualquier flujo de trabajo.

source: Git lets you put the string `$Format:$` in any file with any of the `--pretty=format` formatting shortcodes, many of which you saw in Chapter 2.
es: Git te permite poner la cadena '$Format:$' en cualquier archivo, con cualquiera de las claves de formateo de '--pretty=format' que vimos en el capítulo 2.

source: The answer is the HEAD file.
es: La respuesta a esta pregunta es el archivo HEAD (CABEZA).

source: I’ll cover aspects of each of these in a series of use cases, moving from simple to more complex; you should be able to construct the specific workflows you need in practice from these examples.
es: Vamos a cubrir ciertos aspectos de todo esto, en una serie de casos de uso; desde los más sencillos hasta los más complejos. A partir de dichos ejemplos, tendrías que ser capaz de construir la forma de trabajo específica que necesites para cada caso.

source: Now Jessica merges in John’s work (`origin/master`):
es: Tras esto, jessica fusiona el trabajo de John ('origin/master'):

source: If anyone wants to verify a tag, they can directly import your PGP key by pulling the blob directly out of the database and importing it into GPG:
es: Cualquiera que desee verificar la autenticidad de una etiqueta, no tiene más que importar tu clave PGP, sacando el objecto directamente de la base de datos e importandolo en GPG:,

source: Finally, you don’t need to be in interactive add mode to do the partial-file staging — you can start the same script by using `git add -p` or `git add --patch` on the command line.
es: Por último, cabe comentar que no es necesario entrar expresamente en el modo interactivo para preparar archivos parcialmente. También se puede acceder a ese script con los comandos 'git add -p' o con 'git add --patch', directamente desde la línea de comandos.

source: First, you don’t want to submit any whitespace errors.
es: En primer lugar, no querrás enviar ningún error de espaciado.

source: You can exclude commits in the master branch by adding the `--not` option before the branch name.
es: Puedes excluir de la lista las confirmaciones de tu rama principal añadiendo la opción '--not' delante del nombre de la rama.

source: If, instead of "pick" or "edit", you specify "squash", Git applies both that change and the change directly before it and makes you merge the commit messages together.
es: Si, en lugar de 'pick' o de 'edit', se indica 'squash' delante de alguna de las confirmaciones de cambio, Git aplicará simultáneamente dicha confirmación y la que esté inmediatamente delante de ella. Permitiendo también combinar los mensajes de ambas.

source: In the 1.6 series of Git, you can also use a macro that is provided that means `-crlf -diff`:
es: A partir de la versión 1.6 de Git, puedes utilizar una macro en lugar de las dos opciones '-crlf -diff':

source: The “smudge” filter is run on checkout.
es: El filtro "smudge" se usa al extraer (checkout).

source: You’re looking for any commit that is reachable from the last commit on the remote and that isn’t reachable from any parent of any of the SHAs you’re trying to push up — meaning it’s a fast-forward.
es: Estas mirando por cualquier confirmación que se pueda alcanzar desde la última en la parte remota, pero que no se pueda alcanzar desde ninguno de los padres de cualquiera de las claves SHA que estás intentando enviar. Es decir, confirmaciones de avance-rápido.

source: This command shows you only the work your current topic branch has introduced since its common ancestor with master.
es: Este comando mostrará únicamente el trabajo en tu actual rama puntual que haya sido introducido a partir de su ancestro común con la rama 'master'.

source: Your working directory is clean:
es: Con ello, se limpia el área de trabajo:

source: When your work has been pushed up to your fork, you need to notify the maintainer.
es: Tras enviar (push) tu trabajo a tu copia bifurcada (fork), has de notificarselo al gestor del proyecto.

source: So, in the following file
es: Poniendo en el siguiente archivo:

source: To begin, you should check your commit message just before each commit is recorded, so you know the server won’t reject your changes due to badly formatted commit messages.
es: Para empezar, se necesita chequear el mensaje de confirmación inmediatamente antes de cada confirmación de cambios, para segurarse de que el servidor no los rechazará debido a un mensaje mal formateado.

source: This is common if you’re coming from CVS or Subversion, where you’ve defined a module or collection of subdirectories, and you want to keep this type of workflow.
es: Se da frecuentemente en equipos procedentes de CVS o de Subversion (donde se define una colección de módulos o carpetas), cuando desean mantener ese mismo tipo de flujo de trabajo.

source: Here’s an example.
es: Un ejemplo concreto.

source: The whole method looks like this:
es: El método completo será algo así como:

source: To e-mail this to a mailing list, you can either paste the file into your e-mail program or send it via a command-line program.
es: Para enviar estos archivos a la lista de correo,puedes tanto pegar directamente el archivo en tu programa de correo electrónico, como enviarlo a través de algún programa basado en línea de comandos.

source: Then, you can send a request to the maintainer of the main project to pull in your changes.
es: Después, enviarás una petición a la persona gestora del proyecto principal, para que recupere y consolide (pull) en él tus cambios.

source: You can’t record a submodule at `master` or some other symbolic reference.
es: No es posible almacenar un submódulo en `master` o en cualquier otra referencia simbólica.

source: So, to create a tree object, you first have to set up an index by staging some files.
es: Por tanto, para crear un objeto árbol, previamente has de crear un índice preparando algunos archivos para ser almacenados.

source: For the sake of simplicity we’ll simply run it as the same 'git' user that Gitosis is running as.
es: Para simplificar, en estos ejemplos vamos a lanzar el demonio Git bajo el mismo usuario 'git' con el que hemos lanzado Gitosis.

source: Some people have full access, and others only have access to push changes to certain subdirectories or specific files.
es: Algunas personas tendrán acceso completo, y otras tan solo acceso a ciertas carpetas o a ciertos archivos.

source: You can also create a zip archive in much the same way, but by passing the `--format=zip` option to `git archive`:
es: También puedes crear un archivo zip de la misma manera, tan solo indicando la opción '--format=zip' al comando 'git archive':

source: History after cherry-picking a commit on a topic branch.
es: Historial tras entresacar una confirmación de cambios de una rama puntual.

source: It’s almost identical to running a `patch -p1` command to apply the patch, although it’s more paranoid and accepts fewer fuzzy matches then patch.
es: Es prácticamente idéntico a lanzar el comando 'patch -p1', aunque es más paranoico y acepta menos coincidencias aproximadas.

source: You can enable push access; but given the lack of authentication, if you turn on push access, anyone on the internet who finds your project’s URL could push to your project.
es: Aunque realmente si que puedes habilitar el envio, si lo haces, dada la total falta de ningún mecanismo de autentificación, cualquiera que encuentre la URL a tu proyecto en Internet, podrá enviar (push) contenidos a él.

source: These protocols have a process on the remote end that is intelligent about Git — it can read local data and figure out what the client has or needs and generate custom data for it.
es: Estos protocolos suelen tener procesos en el lado remoto y conocen acerca de la estructura de datos Git en ese lado, --pueden leer datos localmente y determinar lo que el cliente tiene ya o necesita a continuación, para generar automáticamente datos expresamente preparados para él--.

source: To do that, you must run the `git stash apply` command with a `--index` option to tell the command to try to reapply the staged changes.
es: Para conseguir esto último, es necesario emplear la opción `--index` del comando `git stash apply`. Con ella se le indica que debe intentar reaplicar también el estado de preparación de los archivos.

source: After two more commits, your history might look something like Figure 3-2.
es: Tras un par de confirmaciones más, el registro ha de ser algo parecido a la Figura 3-2.

source: You’ll follow these steps:
es: Imagina que sigues los siquientes pasos:

source: If you run `git checkout test`, Git updates the file to look like this:
es: Si lanzas el comando `git checkout test`, Git actualiza el contenido del archivo:

source: Suppose your repository contains the following branches and tags:
es: Por ejemplo, suponiendo que tienes las siguientes ramas y etiquetas en tu repositorio:

source: `HEAD~2` means "the first parent of the first parent," or "the grandparent" — it traverses the first parents the number of times you specify.
es: `HEAD~2` significa "el primer padre del primer padre", es decir, "el abuelo". Y así según el número de veces que se indique.

source: The idea of the subtree merge is that you have two projects, and one of the projects maps to a subdirectory of the other one and vice versa.
es: La idea subyacente tras toda fusión subarborea es la de que se tienen dos proyectos; y uno de ellos está relacionado con una subcarpeta en el otro, y viceversa.
